/*
 * version.h
 *
 *  Created on: 03.09.2012
 *      Author: админ
 */

#ifndef VERSION_H_
#define VERSION_H_
/*
1)Сохранить не работает
2)нижняя панель поверх всех окон????
3)в компилятор передается 8 параметров(значащих 5)
4)цвет названий и значений операторов
5)заполнить параметры компиляции в compiler.cfg и вызывать compile.bat без параметров(нужно поправить main в java)
6)определиться какой файл отрисовывать(equidList.cpp или list.cpr.cpp)
7)после отрисовки центрировать и отображать всю УП
8)двигать плот не только мышью но и клавиатурой
9)генерировать параметры УП в компиляторе чтоб форма могла их отобразить
10)F кнопки располагать по всей длине формы
11)сохранить, очистить, вызов каталога, масштаб, повернуть, перевернуть, диалог функции автоповорот
12)увеичить кнопки вверх, вниз, папка
13)если выйти в самый корень cps по кнопкам теряется фокус
14)подкрашивать команды формата m81.1
*/

#endif /* VERSION_H_ */
