/*
 * version.h
 *
 *  Created on: 03.09.2012
 *      Author: админ
 */

#ifndef VERSION_H_
#define VERSION_H_
/*
 *  + по старту грузить последнюю загруженную УП.
 *  + парсить файл info.
 *  ? в случае ошибки, позиционироваться на строку ошибки.
 *  + убрать дабл клик на плоте.
 *
 *  + запретить вызов диалога "переехать" при отработке УП.
 *  + уск-норм=замедл подсвечивать только тек режим
 *  + Наладка: загрузить сохранить на кнопки
 *
 *  + клавиатура: режим УП, Наладка, диалог "сохр как"
 *  + utils.xml, в режим управление кнопка F6
 *  - подчистить код.
*/

#endif /* VERSION_H_ */
